package Topic1_BasicJavaConcepts;

//  Главната задача на програмиста е да разрешава проблеми от реалния живот във виртуалния.
//  Работим с данни(информация). В повечето случаи ние правим преработка на тези данни.
//  Преработената информация се запазва в БД(Бази данни) за перманентно съхранение.
//  Но докато преработваме информацията тя се съхранява в променливи.

//  Променлива(Variable) - променливата притежава тип и име с което да бъде извиквана.
//  Java е силно-типизиран(strongly typed) език което ни задължава при деклариране на променлива
//  задължително да отбележим типа на данните.

//  Дефиниране на променлива - задаване на тип и име.
//  Инициализиране на променлива - задаване на стойност.
//  Израз - всичко което се намира от дясно на знака = при дефиниране.
//  След всяко твърдение поставяме ; като знак за край


public class Lesson3_VariablesInJava {
    public static void main(String[] args) {
        
        int num1 = 3;
        int num2 = 5;
        int result = num1 + num2;

        System.out.println(result);
        
    }
}
