package Topic3_Loops;

// Нуждата от loop - цикъл ползва се когато искаме да повторим действие

public class Lesson1_NeedForLoop {
    public static void main(String[] args) {
        // Ако искаме да повторим този ред няколко пъти ще е по-удобно да използваме цикъл
        System.out.println("Hello");

        // Видовете цикли са: for, while, do while
        // като всеки един цикъл ще има нужда от определено условие
        // за да се изпълни тялото му... 
        // Всяко преминаване през тялото на цикъла се нарича - ИТЕРАЦИЯ
        
    }
}
